# -------------- сегментація потокового відео в opencv ------------------

'''
Цифрова обробка зображень: векторизація на відеопотоці

Package                      Version
---------------------------- -----------
opencv-python                3.4.18.65
numpy                        1.23.5
pip                          23.1
Pillow                       9.4.0
matplotlib                   3.6.2
scipy                        1.10.0

'''

import cv2
import time

# -------------------- завантаження відео з файлу ----------------------
cap = cv2.VideoCapture('Video_1.mp4')
# -------------- загрузка відео з вбудованої камери -----------------
# cap = cv2.VideoCapture(0) # завантаження потокового відео з вбудованої відеокамери

while (True):
    ret, frame = cap.read()
    time.sleep(0.03)
    # -------------- конверція відеопотоку в монохром ------------
    gray = cv2.cvtColor(frame, cv2.COLOR_BGR2GRAY)
    imS1 = cv2.resize(frame, (400, 250))  # зміна вікна відображення оригіналу
    imS2 = cv2.resize(gray, (400, 250))   # зміна вікна відображення монохрома
    blur1 = cv2.Canny(imS2, 100, 200)     # Сегментація оригіналу за Кенні
    blur2 = cv2.Canny(imS1, 100, 200)     # Сегментація монохрома за Кенні
    imS3 = cv2.resize(gray, (400, 250))   # зміна вікна відображення сегментації

    cv2.imshow('Video', imS1)   # отображения оригинала
    cv2.imshow('Frame', imS2)   # отображения монохрома
    cv2.imshow('blur1', blur1)  # отображения монохрома
    cv2.imshow('blur2', blur2)  # отображения монохрома

    # ------ відображення змін значень пікселей потокового відео - динамічних картинок
    print(frame)
    # ------ умова завершення відображення відеопотоку за клавішею q
    if cv2.waitKey(1) & 0xFF == ord('q'):
        break

cap.release()
cv2.destroyAllWindows()